Aim:
1) Provide summery statistics for a dataset with numeric varibles grouped by one
of the qualitative variables.
2) write a python program to display some basic statistical details like percentile,
mean, standard devivation , etc.

In [1]:
import pandas as pd

In [2]:
df= pd.read_csv('student.csv')

In [3]:
df

   roll     name class  marks   age
0     1     anil    TE  56.77  22.0
1     2     amit    TE  59.77  21.0
2     3   aniket    BE  76.88  19.0
3     4  ajunkya    TE  69.66   NaN
4     5     asha   NaN  63.28  20.0
5     6   ayesha    BE  49.55  20.0
6     7     amar    BE    NaN  19.0
7     8    amita    BE    NaN  23.0
8     9     amol    TE  56.75  20.0
9    10    anmol    BE  78.66  21.0

In [4]:
df.mean()
#mean

C:\Users\Atharv Kshirsagar\AppData\Local\Temp\ipykernel_10220\2324897766.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

roll      5.500000
marks    63.915000
age      20.555556
dtype: float64

In [5]:
df.median()
#median

C:\Users\Atharv Kshirsagar\AppData\Local\Temp\ipykernel_10220\3750896793.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

roll      5.500
marks    61.525
age      20.000
dtype: float64

In [6]:
#standarad deviation
df.std()

C:\Users\Atharv Kshirsagar\AppData\Local\Temp\ipykernel_10220\2682428387.py:2: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

roll      3.027650
marks    10.315294
age       1.333333
dtype: float64

In [7]:
df.mode()

   roll     name class  marks   age
0     1  ajunkya    BE  49.55  20.0
1     2     amar   NaN  56.75   NaN
2     3     amit   NaN  56.77   NaN
3     4    amita   NaN  59.77   NaN
4     5     amol   NaN  63.28   NaN
5     6   aniket   NaN  69.66   NaN
6     7     anil   NaN  76.88   NaN
7     8    anmol   NaN  78.66   NaN
8     9     asha   NaN    NaN   NaN
9    10   ayesha   NaN    NaN   NaN

In [8]:
df.mode(dropna="false")

   roll     name class  marks   age
0     1  ajunkya    BE  49.55  20.0
1     2     amar   NaN  56.75   NaN
2     3     amit   NaN  56.77   NaN
3     4    amita   NaN  59.77   NaN
4     5     amol   NaN  63.28   NaN
5     6   aniket   NaN  69.66   NaN
6     7     anil   NaN  76.88   NaN
7     8    anmol   NaN  78.66   NaN
8     9     asha   NaN    NaN   NaN
9    10   ayesha   NaN    NaN   NaN

In [9]:
df.min()
#min

C:\Users\Atharv Kshirsagar\AppData\Local\Temp\ipykernel_10220\2848831385.py:1: FutureWarning: The default value of numeric_only in DataFrame.min is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.min()

roll           1
name     ajunkya
marks      49.55
age         19.0
dtype: object

In [10]:
df.max()
#max

C:\Users\Atharv Kshirsagar\AppData\Local\Temp\ipykernel_10220\3883171465.py:1: FutureWarning: The default value of numeric_only in DataFrame.max is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.max()

roll         10
name     ayesha
marks     78.66
age        23.0
dtype: object

In [15]:
gr2 = df.groupby('age')

In [16]:
gr2.groups

{19.0: [2, 6], 20.0: [4, 5, 8], 21.0: [1, 9], 22.0: [0], 23.0: [7]}

In [17]:
tw = gr2.get_group(20)

In [18]:
tw

   roll    name class  marks   age
4     5    asha   NaN  63.28  20.0
5     6  ayesha    BE  49.55  20.0
8     9    amol    TE  56.75  20.0

In [19]:
import seaborn as sns

In [20]:
df = sns.load_dataset('iris')

In [21]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [23]:
#https://mitu.co.in
df=pd.read_csv('iris.csv')
df
df.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [24]:
gr = df.groupby('Species')

In [25]:
se = gr.get_group('Iris-setosa')
ve = gr.get_group('Iris-versicolor')
vi = gr.get_group('Iris-virginica')

In [26]:
se.shape

(50, 6)

In [27]:
se.mean()

C:\Users\Atharv Kshirsagar\AppData\Local\Temp\ipykernel_10220\3349668815.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  se.mean()

Id               25.500
SepalLengthCm     5.006
SepalWidthCm      3.418
PetalLengthCm     1.464
PetalWidthCm      0.244
dtype: float64

In [31]:
ve.shape

(50, 6)

In [32]:
ve.mean()

C:\Users\Atharv Kshirsagar\AppData\Local\Temp\ipykernel_10220\809383855.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  ve.mean()

Id               75.500
SepalLengthCm     5.936
SepalWidthCm      2.770
PetalLengthCm     4.260
PetalWidthCm      1.326
dtype: float64

In [33]:
vi.shape

(50, 6)

In [34]:
vi.mean()

C:\Users\Atharv Kshirsagar\AppData\Local\Temp\ipykernel_10220\3986102254.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  vi.mean()

Id               125.500
SepalLengthCm      6.588
SepalWidthCm       2.974
PetalLengthCm      5.552
PetalWidthCm       2.026
dtype: float64